## Ordinal Number Encoding

In [4]:
import datetime

In [5]:
today_date=datetime.datetime.today()

In [6]:
today_date

datetime.datetime(2021, 7, 16, 21, 2, 38, 56642)

In [7]:
today_date-datetime.timedelta(1)  ###difference between 2 date time values

datetime.datetime(2021, 7, 15, 21, 2, 38, 56642)

In [8]:
today_date-datetime.timedelta(3)

datetime.datetime(2021, 7, 13, 21, 2, 38, 56642)

In [9]:
#### List Comprehension

days=[today_date-datetime.timedelta(x) for x in range (0,15)]

In [10]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["day"]

In [11]:
data.head()

                         day
0 2021-07-16 21:02:38.056642
1 2021-07-15 21:02:38.056642
2 2021-07-14 21:02:38.056642
3 2021-07-13 21:02:38.056642
4 2021-07-12 21:02:38.056642

In [12]:
data['weekday']=data["day"].dt.weekday_name

In [13]:
data.head()

                         day    weekday
0 2021-07-16 21:02:38.056642     Friday
1 2021-07-15 21:02:38.056642   Thursday
2 2021-07-14 21:02:38.056642  Wednesday
3 2021-07-13 21:02:38.056642    Tuesday
4 2021-07-12 21:02:38.056642     Monday

In [14]:
data["day"].dt.month

0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
12    7
13    7
14    7
Name: day, dtype: int64

In [15]:
data["day"].dt.year

0     2021
1     2021
2     2021
3     2021
4     2021
5     2021
6     2021
7     2021
8     2021
9     2021
10    2021
11    2021
12    2021
13    2021
14    2021
Name: day, dtype: int64

In [16]:
dict={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [17]:
dict

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [18]:
data['weekday_ordinal']=data['weekday'].map(dict)

In [19]:
data

                          day    weekday  weekday_ordinal
0  2021-07-16 21:02:38.056642     Friday                5
1  2021-07-15 21:02:38.056642   Thursday                4
2  2021-07-14 21:02:38.056642  Wednesday                3
3  2021-07-13 21:02:38.056642    Tuesday                2
4  2021-07-12 21:02:38.056642     Monday                1
5  2021-07-11 21:02:38.056642     Sunday                7
6  2021-07-10 21:02:38.056642   Saturday                6
7  2021-07-09 21:02:38.056642     Friday                5
8  2021-07-08 21:02:38.056642   Thursday                4
9  2021-07-07 21:02:38.056642  Wednesday                3
10 2021-07-06 21:02:38.056642    Tuesday                2
11 2021-07-05 21:02:38.056642     Monday                1
12 2021-07-04 21:02:38.056642     Sunday                7
13 2021-07-03 21:02:38.056642   Saturday                6
14 2021-07-02 21:02:38.056642     Friday                5

#### Count or Frequency Encoding

In [20]:
df=pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [21]:
df[1].unique

<bound method Series.unique of 0                State-gov
1         Self-emp-not-inc
2                  Private
3                  Private
4                  Private
5                  Private
6                  Private
7         Self-emp-not-inc
8                  Private
9                  Private
10                 Private
11               State-gov
12                 Private
13                 Private
14                 Private
15                 Private
16        Self-emp-not-inc
17                 Private
18                 Private
19        Self-emp-not-inc
20                 Private
21                 Private
22             Federal-gov
23                 Private
24                 Private
25               Local-gov
26                 Private
27                       ?
28                 Private
29                 Private
               ...
32531                    ?
32532              Private
32533              Private
32534              Private
32535              Private
32536              Private
32537              Private
32538              Private
32539                    ?
32540            State-gov
32541                    ?
32542                    ?
32543            Local-gov
32544              Private
32545            Local-gov
32546              Private
32547              Private
32548     Self-emp-not-inc
32549            State-gov
32550     Self-emp-not-inc
32551              Private
32552              Private
32553              Private
32554              Private
32555              Private
32556              Private
32557              Private
32558              Private
32559              Private
32560         Self-emp-inc
Name: 1, Length: 32561, dtype: object>

In [22]:
columns=[1,3,5,6,7,8,9,13]

In [23]:
df=df[columns]

In [24]:
df.columns=['Employment','Degree','Status','Designation','family_job','race','Sex','country']

In [25]:
df.head()

,Employment,Degree,Status,Designation,family_job,race,Sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [26]:
for feature in df.columns[:]:
    print(feature,":",len(df[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
race : 5 labels
Sex : 2 labels
country : 42 labels

In [30]:
country_map=df['country'].value_counts().to_dict()

In [31]:
df['country']=df['country'].map(country_map)

In [33]:
df.head()

,Employment,Degree,Status,Designation,family_job,race,Sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

### Target guided ordinal encoding
1.Ordering the lables according to the target 

2.replacing the labels by the joint probability of being 1 or 0

In [35]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])

In [36]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [38]:
df['Cabin'].fillna('missing',inplace=True)

In [39]:
df.head()

   Survived    Cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing

In [41]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [42]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [43]:
df.Cabin.unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [46]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [48]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [50]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [53]:
enumerate(ordinal_labels,0)

In [55]:

ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)} ###d is having the highest value so based on that rank is given 
ordinal_labels2

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [56]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     m                     1
1         1     C                     4
2         1     m                     1
3         1     C                     4
4         0     m                     1